ra-rs/ra/svd/vendor/R7FA2A2AD.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>ICU</name>
            <description>ICU for CPU</description>
            <baseAddress>0x40006000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x120</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x130</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x140</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1A0</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C0</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x200</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x300</offset>
                <size>272</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>IEL0</name>
                <description>ICU Interrupt 0</description>
                <value>0</value>
            </interrupt>
            <interrupt>
                <name>IEL1</name>
                <description>ICU Interrupt 1</description>
                <value>1</value>
            </interrupt>
            <interrupt>
                <name>IEL2</name>
                <description>ICU Interrupt 2</description>
                <value>2</value>
            </interrupt>
            <interrupt>
                <name>IEL3</name>
                <description>ICU Interrupt 3</description>
                <value>3</value>
            </interrupt>
            <interrupt>
                <name>IEL4</name>
                <description>ICU Interrupt 4</description>
                <value>4</value>
            </interrupt>
            <interrupt>
                <name>IEL5</name>
                <description>ICU Interrupt 5</description>
                <value>5</value>
            </interrupt>
            <interrupt>
                <name>IEL6</name>
                <description>ICU Interrupt 6</description>
                <value>6</value>
            </interrupt>
            <interrupt>
                <name>IEL7</name>
                <description>ICU Interrupt 7</description>
                <value>7</value>
            </interrupt>
            <interrupt>
                <name>IEL8</name>
                <description>ICU Interrupt 8</description>
                <value>8</value>
            </interrupt>
            <interrupt>
                <name>IEL9</name>
                <description>ICU Interrupt 9</description>
                <value>9</value>
            </interrupt>
            <interrupt>
                <name>IEL10</name>
                <description>ICU Interrupt 10</description>
                <value>10</value>
            </interrupt>
            <interrupt>
                <name>IEL11</name>
                <description>ICU Interrupt 11</description>
                <value>11</value>
            </interrupt>
            <interrupt>
                <name>IEL12</name>
                <description>ICU Interrupt 12</description>
                <value>12</value>
            </interrupt>
            <interrupt>
                <name>IEL13</name>
                <description>ICU Interrupt 13</description>
                <value>13</value>
            </interrupt>
            <interrupt>
                <name>IEL14</name>
                <description>ICU Interrupt 14</description>
                <value>14</value>
            </interrupt>
            <interrupt>
                <name>IEL15</name>
                <description>ICU Interrupt 15</description>
                <value>15</value>
            </interrupt>
            <interrupt>
                <name>IEL16</name>
                <description>ICU Interrupt 16</description>
                <value>16</value>
            </interrupt>
            <interrupt>
                <name>IEL17</name>
                <description>ICU Interrupt 17</description>
                <value>17</value>
            </interrupt>
            <interrupt>
                <name>IEL18</name>
                <description>ICU Interrupt 18</description>
                <value>18</value>
            </interrupt>
            <interrupt>
                <name>IEL19</name>
                <description>ICU Interrupt 19</description>
                <value>19</value>
            </interrupt>
            <interrupt>
                <name>IEL20</name>
                <description>ICU Interrupt 20</description>
                <value>20</value>
            </interrupt>
            <interrupt>
                <name>IEL21</name>
                <description>ICU Interrupt 21</description>
                <value>21</value>
            </interrupt>
            <interrupt>
                <name>IEL22</name>
                <description>ICU Interrupt 22</description>
                <value>22</value>
            </interrupt>
            <interrupt>
                <name>IEL23</name>
                <description>ICU Interrupt 23</description>
                <value>23</value>
            </interrupt>
            <interrupt>
                <name>IEL24</name>
                <description>ICU Interrupt 24</description>
                <value>24</value>
            </interrupt>
            <interrupt>
                <name>IEL25</name>
                <description>ICU Interrupt 25</description>
                <value>25</value>
            </interrupt>
            <interrupt>
                <name>IEL26</name>
                <description>ICU Interrupt 26</description>
                <value>26</value>
            </interrupt>
            <interrupt>
                <name>IEL27</name>
                <description>ICU Interrupt 27</description>
                <value>27</value>
            </interrupt>
            <interrupt>
                <name>IEL28</name>
                <description>ICU Interrupt 28</description>
                <value>28</value>
            </interrupt>
            <interrupt>
                <name>IEL29</name>
                <description>ICU Interrupt 29</description>
                <value>29</value>
            </interrupt>
            <interrupt>
                <name>IEL30</name>
                <description>ICU Interrupt 30</description>
                <value>30</value>
            </interrupt>
            <interrupt>
                <name>IEL31</name>
                <description>ICU Interrupt 31</description>
                <value>31</value>
            </interrupt>
            <registers>
                <register>
                    <dim>12</dim>
                    <dimIncrement>0x1</dimIncrement>
                    <dimIndex>0-11</dimIndex>
                    <name>IRQCR%s</name>
                    <description>IRQ Control Register %s</description>
                    <addressOffset>0x000</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>IRQMD</name>
                            <description>IRQi Detection Sense Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Falling edge</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Rising edge</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Rising and falling edges</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Low level</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCLKSEL</name>
                            <description>IRQi Digital Filter Sampling Clock Select</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>PCLKB</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>PCLKB/8</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>PCLKB/32</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>PCLKB/64</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FLTEN</name>
                            <description>IRQi Digital Filter Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Digital filter is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Digital filter is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMICR</name>
                    <description>NMI Pin Interrupt Control Register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>NMIMD</name>
                            <description>NMI Detection Set</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Falling edge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Rising edge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NFCLKSEL</name>
                            <description>NMI Digital Filter Sampling Clock Select</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>PCLKB</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>PCLKB/8</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>PCLKB/32</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>PCLKB/64</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NFLTEN</name>
                            <description>NMI Digital Filter Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
