ra-rs/ra/svd/vendor/R7FA2A2AD.svd
                <register>
                    <name>WUPEN0</name>
                    <description>Wake Up Interrupt Enable Register 0</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>IRQWUPEN</name>
                            <description>IRQ Interrupt Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by IRQn interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by IRQn interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IWDTWUPEN</name>
                            <description>IWDT Interrupt Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by IWDT interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by IWDT interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD1WUPEN</name>
                            <description>LVD1 Interrupt Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by LVD1 interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by LVD1 interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD2WUPEN</name>
                            <description>LVD2 Interrupt Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by LVD2 interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by LVD2 interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVDVBATWUPEN</name>
                            <description>LVDVBAT Interrupt Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by LVDVBAT interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by LVDVBAT interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVDVRTCWUPEN</name>
                            <description>LVDVRTC Interrupt Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by LVDVRTC interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by LVDVRTC interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVDEXLVDWUPEN</name>
                            <description>LVDEXLVD Interrupt Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by LVDEXLVD interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by LVDEXLVD interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTCALM1WUPEN</name>
                            <description>RTC Alarm Interrupt 1 Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by RTCALM1 interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by RTCALM1 interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTCALM0WUPEN</name>
                            <description>RTC Alarm Interrupt 0 Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by RTC alarm interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by RTC alarm interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTCPRDWUPEN</name>
                            <description>RTC Period Interrupt Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by RTC period interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by RTC period interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AGTW0UDWUPEN</name>
                            <description>AGTW0 Underflow Interrupt Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by AGTW0 underflow interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by AGTW0 underflow interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AGTW1UDWUPEN</name>
                            <description>AGTW1 Underflow Interrupt Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by AGTW1 underflow interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by AGTW1 underflow interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AGTW1CAWUPEN</name>
                            <description>AGTW1 Compare Match A Interrupt Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by AGTW1 compare match A interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by AGTW1 compare match A interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AGTW1CBWUPEN</name>
                            <description>AGTW1 Compare Match B Interrupt Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by AGTW1 compare match B interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by AGTW1 compare match B interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IIC0WUPEN</name>
                            <description>IIC0 Address Match Interrupt Software Standby/Snooze Mode Returns Enable</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze mode returns by IIC0 address match interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze mode returns by IIC0 address match interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
