ra-rs/ra/svd/vendor/R7FA2A2AD.svd
                <register>
                    <name>VLCD</name>
                    <description>LCD Boost Level Control Register</description>
                    <addressOffset>0x03</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x04</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>VLCD</name>
                            <description>Reference Voltage Select (Contrast Adjustment)</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x4</name>
                                    <description>1.01 V (VL1 reference voltage) 2.02 V (VL2 reference voltage) </description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5</name>
                                    <description>1.04 V (VL1 reference voltage) 2.09 V (VL2 reference voltage) </description>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6</name>
                                    <description>1.07 V (VL1 reference voltage) 2.16 V (VL2 reference voltage) </description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7</name>
                                    <description>1.11 V (VL1 reference voltage) 2.22 V (VL2 reference voltage) </description>
                                    <value>0x7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x8</name>
                                    <description>1.14 V (VL1 reference voltage) 2.29 V (VL2 reference voltage) </description>
                                    <value>0x8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x9</name>
                                    <description>1.17 V (VL1 reference voltage) 2.36 V (VL2 reference voltage) </description>
                                    <value>0x9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xA</name>
                                    <description>1.21 V (VL1 reference voltage) 2.42 V (VL2 reference voltage) </description>
                                    <value>0xa</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xB</name>
                                    <description>1.24 V (VL1 reference voltage) 2.49 V (VL2 reference voltage) </description>
                                    <value>0xb</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xC</name>
                                    <description>1.27 V (VL1 reference voltage) 2.56 V (VL2 reference voltage) </description>
                                    <value>0xc</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xD</name>
                                    <description>1.31 V (VL1 reference voltage) 2.62 V (VL2 reference voltage) </description>
                                    <value>0xd</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xE</name>
                                    <description>1.34 V (VL1 reference voltage) 2.69 V (VL2 reference voltage) </description>
                                    <value>0xe</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xF</name>
                                    <description>1.37 V (VL1 reference voltage) 2.76 V (VL2 reference voltage) </description>
                                    <value>0xf</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x10</name>
                                    <description>1.40 V (VL1 reference voltage) 2.82 V (VL2 reference voltage) </description>
                                    <value>0x10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x11</name>
                                    <description>1.44 V (VL1 reference voltage) 2.89 V (VL2 reference voltage) </description>
                                    <value>0x11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x12</name>
                                    <description>1.47 V (VL1 reference voltage) 2.96 V (VL2 reference voltage) </description>
                                    <value>0x12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x13</name>
                                    <description>1.50 V (VL1 reference voltage) 3.02 V (VL2 reference voltage) </description>
                                    <value>0x13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x14</name>
                                    <description>1.54 V (VL1 reference voltage) 3.09 V (VL2 reference voltage) </description>
                                    <value>0x14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x15</name>
                                    <description>1.57 V (VL1 reference voltage) 3.15 V (VL2 reference voltage) </description>
                                    <value>0x15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x16</name>
                                    <description>1.60 V (VL1 reference voltage) 3.22 V (VL2 reference voltage) </description>
                                    <value>0x16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x17</name>
                                    <description>1.64 V (VL1 reference voltage) 3.29 V (VL2 reference voltage) </description>
                                    <value>0x17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x18</name>
                                    <description>1.67 V (VL1 reference voltage) 3.35 V (VL2 reference voltage) </description>
                                    <value>0x18</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x19</name>
                                    <description>1.70 V (VL1 reference voltage) 3.42 V (VL2 reference voltage) </description>
                                    <value>0x19</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1A</name>
                                    <description>1.74 V (VL1 reference voltage) 3.49 V (VL2 reference voltage) </description>
                                    <value>0x1a</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MDSET2</name>
                            <description>Reference Voltage Selection</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>External resistance division method or VL1 reference mode of internal voltage boosting method or VCC reference mode of capacitor split method</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>VL2 reference mode of internal voltage boosting method or VL4 reference mode of capacitor split method</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
