ra-rs/ra/svd/vendor/R7FA2A2AD.svd
                <register>
                    <name>SDADISR</name>
                    <description>Sigma-Delta A/D Interrupt Status Register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x22</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>ZCI0</name>
                            <description>Zero-cross detection interrupt status for zero-cross detection 0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Zero-cross detection interrupt 0 (SDADC_ADZC0) signal is 0</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Zero-cross detection interrupt 0 (SDADC_ADZC0) signal is 1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ZC0</name>
                            <description>DF output status for zero-cross detection 0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>DF output is negative</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DF output is positive</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ZCI1</name>
                            <description>Zero-cross detection interrupt status for zero-cross detection 1</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Zero-cross detection interrupt 1 (SDADC_ADZC1) signal is 0</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Zero-cross detection interrupt 1 (SDADC_ADZC1) signal is 1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ZC1</name>
                            <description>DF output status for Zero-cross detection 1</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>DF output is negative</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DF output is positive</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SDADPHCR%s</name>
                    <description>Sigma-Delta A/D Phase Control Register %s</description>
                    <addressOffset>0x40</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>PH</name>
                            <description>Phase adjustment for channel n (n = 0 to 6)</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-6</dimIndex>
                    <name>SDADCR%s</name>
                    <description>Sigma-Delta A/D Conversion Result Register %s Type 1</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SDADCR</name>
                            <description>A/D conversion result for channel n Type 1</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>SDADCR%sT2</name>
                    <description>Sigma-Delta A/D Conversion Result Register %s Type 2</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SDADCR</name>
                            <description>A/D conversion result for channel m Type 2</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-6</dimIndex>
                    <name>SDADCRLPF%s</name>
                    <description>Sigma-Delta A/D Conversion Result Register (LPF) %s Type 1</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SDADCR</name>
                            <description>A/D conversion result for channel n LPF output Type 1</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>SDADCRLPF%sT2</name>
                    <description>Sigma-Delta A/D Conversion Result Register (LPF) %s Type 2</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SDADCR</name>
                            <description>A/D conversion result for channel m LPF output Type 2</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
